#!/usr/bin/env python
# -*-encoding: utf-8-*-

"""
@Version: Python 3.6.2
@Author: ZWL
@Project: py3
@File: super_three_level_menu.py
@Time: 2017/08/11 14:12
"""

Menu={  '广东省':
            {'广州市':
                {'越秀区':{},'海珠区':{},'荔湾区':{},'天河区':{},'白云区':{},'花都区':{},'番禺区':{},'增城区':{},'从化区':{},'南沙区':{},'黄埔区':{},'萝岗区':{}},
            '深圳市':
                {'罗湖区':{},'龙岗区':{},'福田区':{},'南山区':{},'盐田区':{},'宝安区':{},'大鹏新区':{},'坪山新区':{},'龙华新区':{},'光明新区':{}},
            '珠海市':
                {'香洲':{},'斗门':{},'金湾':{}},
            '汕头市':
                {'金平区':{},'龙湖区':{},'澄海区':{},'濠江区':{},'朝阳区':{},'潮南区':{},'南澳县':{}},
            '佛山市':
                {'禅城区':{},'南海区':{},'顺德区':{},'三水区':{},'高明区':{}},
            '韶关市':
             {'武江区':{},'浈江区':{},'曲江区':{},'始兴县':{},'仁化县':{},'翁源县':{},'乳源县':{},'新丰县':{},'乐昌市':{},'南雄市':{}},
            '湛江市':
                {'赤坎区':{},'霞山区':{},'坡头区':{},'麻章区':{},'廉江市':{},'雷州市':{},'吴川市':{},'遂溪县':{},'徐闻县':{}},
            '肇庆市':
                {'端州区':{},'鼎湖区':{},'广宁':{},'怀集':{},'封开':{},'德庆':{}},
            '江门市':
                {'蓬江区':{},'江海区':{},'新会区':{},'外海镇':{},'礼乐镇':{},'潮连镇':{},'荷塘镇':{},'杜阮镇':{},'棠下镇':{}},
            '茂名市':
                {'茂南区':{},'茂港区':{},'电白县':{},'化州市':{},'高州市':{},'信宜市':{}},
            '惠州市':
                {'惠城区':{},'惠阳区':{},'博罗县':{},'惠东县':{},'龙门县':{}},
            '清远市':
                {'清城区':{},'英德市':{},'连州市':{},'佛冈县':{},'阳山县':{},'清新县':{},'连山壮族瑶族自治县':{},'连南瑶族自治县':{}},
            '东莞市':
                {'莞城街道':{},'南城街道':{},'东城街道':{},'万江街道':{},'石碣镇':{},'石龙镇':{},'茶山镇':{},'石排镇':{},'企石镇':{},'横沥镇':{},'桥头镇':{},'谢岗镇':{},'东坑镇':{},'常平镇':{},'寮步镇':{},'大朗镇':{},'黄江镇':{},'清溪镇':{},'塘厦镇':{},'凤岗镇':{},'长安镇':{},'虎门镇':{},'厚街镇':{},'沙田镇':{},'道滘镇':{},'洪梅镇':{},'麻涌镇':{},'中堂镇':{},'高埗镇':{},'樟木头镇':{},'大岭山镇':{},'望牛墩镇':{}},
            '中山市':
                {'石歧区':{},'东区':{},'西区':{},'南区':{},'五桂山区':{},'火炬开发区':{}},
            '潮州市':
                {'湘桥区':{},'潮安县':{},'饶平县':{}},
            '揭阳市':
                {'榕城区':{},'普宁市':{},'惠来县':{},'揭东县':{},'揭西县':{}},
            '云浮市':
                {'云城区':{},'罗定市':{},'新兴县':{},'郁南县':{},'云安县':{}}
            },
        '河北省':
            {'石家庄市':
                {'长安区':{},'桥西区':{},'井陉矿区':{},'井陉县':{},'栾城县':{},'灵寿县':{},'深泽县':{},'无极县':{},'元氏县':{},'辛集市':{},'晋州市':{},'鹿泉市':{},'桥东区':{},'新华区':{},'裕华区':{},'正定县':{},'行唐县':{},'高邑县':{},'赞皇县':{},'平山县':{},'赵县':{},'藁城市':{},'新乐市':{}},
            '唐山市':
                {'路南区':{},'古冶区':{},'丰南区':{},'滦县':{},'乐亭县':{},'玉田县':{},'遵化市':{},'路北区':{},'开平区':{},'丰润区':{},'滦南县':{},'迁西县':{},'唐海县':{},'迁安市':{}},
            '秦皇岛市':
                {'海港区':{},'北戴河区':{},'昌黎县':{},'卢龙县':{},'山海关区':{},'青龙满族自治县':{},'抚宁县':{}},
            '邯郸市':
                {'邯山区':{},'复兴区':{},'邯郸县':{},'成安县':{},'涉县':{},'肥乡县':{},'邱县':{},'广平县':{},'魏县':{},'武安市':{},'丛台区':{},'峰峰矿区':{},'临漳县':{},'大名县':{},'磁县':{},'永年县':{},'鸡泽县':{},'馆陶县':{},'曲周县':{}},
            '邢台市':
                {'桥东区':{},'邢台县':{},'内丘县':{},'隆尧县':{},'南和县':{},'巨鹿县':{},'广宗县':{},'威县':{},'临西县':{},'沙河市':{},'桥西区':{},'临城县':{},'柏乡县':{},'任县':{},'宁晋县':{},'新河县':{},'平乡县':{},'清河县':{},'南宫市':{}},
            '保定市':
                {'新市区':{},'南市区':{},'清苑县':{},'阜平县':{},'定兴县':{},'高阳县':{},'涞源县':{},'安新县':{},'曲阳县':{},'顺平县':{},'雄县':{},'定州市':{},'高碑店市':{},'北市区':{},'满城县':{},'涞水县':{},'徐水县':{},'唐县':{},'容城县':{},'望都县':{},'易县':{},'蠡县':{},'博野县':{},'涿州市':{},'安国市':{}},
            '张家口市':
                {'桥东区':{},'宣化区':{},'宣化县':{},'康保县':{},'尚义县':{},'阳原县':{},'万全县':{},'涿鹿县':{},'崇礼县':{},'桥西区':{},'下花园区':{},'张北县':{},'沽源县':{},'蔚县':{},'怀安县':{},'怀来县':{},'赤城县':{}},
            '承德市':
                {'双桥区':{},'鹰手营子矿区':{},'兴隆县':{},'滦平县':{},'丰宁满族自治县':{},'围场满族蒙古族自治县':{},'双滦区':{},'承德县':{},'平泉县':{},'隆化县':{},'宽城满族自治县':{}},
            '廊坊市':
                {'安次区':{},'固安县':{},'香河县':{},'文安县':{},'霸州市':{},'广阳区':{},'永清县':{},'大城县':{},'大厂回族自治县':{},'三河市':{}},
            '衡水市':
                 {'桃城区':{},'武邑县':{},'饶阳县':{},'故城县':{},'阜城县':{},'深州市':{},'枣强县':{},'武强县':{},'安平县':{},'景县':{},'冀州市':{}},
            '沧州市':
                 {'新华区':{},'沧县':{},'东光县':{},'盐山县':{},'南皮县':{},'献县':{},'泊头市':{},'黄骅市':{},'运河区':{},'青县':{},'海兴县':{},'肃宁县':{},'吴桥县':{},'孟村回族自治县':{},'任丘市':{},'河间市':{}}
         },
        '山西省':
            {'太原市':
                {'小店区':{},'杏花岭区':{},'万柏林区':{},'清徐县':{},'娄烦县':{},'古交市':{},'迎泽区':{},'尖草坪区':{},'晋源区':{},'阳曲县':{}},
           '大同市':
                {'城区':{},'南郊区':{},'阳高县':{},'广灵县':{},'浑源县':{},'大同县':{},'矿区':{},'新荣区':{},'天镇县':{},'灵县':{},'左云县':{}},
           '阳泉市':
                {'城区':{},'郊区':{},'盂县':{},'矿区':{},'平定县':{}},
           '长治市':
                {'城区':{},'长治县':{},'屯留县':{},'黎城县':{},'长子县':{},'沁县':{},'潞城市':{},'郊区':{},'襄垣县':{},'平顺县':{},'壶关县':{},'武乡县':{},'沁源县':{}},
           '晋城市':
                {'城区':{},'阳城县':{},'泽州县':{},'高平市':{},'沁水县':{},'陵川县':{}},
           '朔州市':
                {'朔城区':{},'怀仁县':{},'平鲁区':{},'山阴县':{},'右玉县':{},'应县':{}},
           '晋中市':
                {'榆次区':{},'左权县':{},'昔阳县':{},'太谷县':{},'平遥县':{},'介休市':{},'榆社县':{},'和顺县':{},'寿阳县':{},'祁县':{},'灵石县':{}},
           '运城市':
                {'盐湖区':{},'万荣县':{},'稷山县':{},'绛县':{},'夏县':{},'芮城县':{},'河津市':{},'临猗县':{},'闻喜县':{},'新绛县':{},'垣曲县':{},'平陆县':{},'永济市':{}},
           '忻州市':
                {'忻府区':{},'五台县':{},'繁峙县':{},'静乐县':{},'五寨县':{},'河曲县':{},'偏关县':{},'原平市':{},'定襄县':{},'代县':{},'宁武县':{},'神池县':{},'岢岚县':{},'保德县':{}},
           '临汾市':
                {'尧都区':{},'翼城县':{},'洪洞县':{},'安泽县':{},'吉县':{},'大宁县':{},'永和县':{},'汾西县':{},'霍州市':{},'曲沃县':{},'襄汾县':{},'古县':{},'浮山县乡宁县':{},'隰县':{},'蒲县':{},'侯马市':{}},
           '吕梁地区':
                {'离石区':{},'交城县':{},'临县':{},'石楼县':{},'方山县':{},'交口县':{},'汾阳市':{},'文水县':{},'兴县':{},'柳林县':{},'岚县':{},'中阳县':{},'孝义市':{}}
         }
      }
current=Menu
current_parrent=[]#列表存储

while True:
    for Keys in current:
        print(Keys)
    #print(current_list)
    choose=input("请输入要查看的省份/城市,返回上一层输入'b',退出输入'quit'：").strip()
    if len(choose) == 0:continue
    elif choose in current:
        current_parrent.append(current) #作为父层
        current=current[choose]         #作为子层
    elif choose=='b':
        if current_parrent:
            current=current_parrent.pop()   #删除列表里的上一层（也就是一个值）,返回输出
        else:
            print("已到最顶层。")
    elif choose=="quit":
        break
    else:
        if current:
            print('无此项目,请重新输入。')
        else:
            print("已到最底层")
